## Pandas  Operations

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({ 'col1' : [1,2,3,4], 
                    'col2' : [444,555,666,444], 
                    'col3' : ['abc', 'def', 'ghi', 'jkl']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [4]:
# finding a unique values in a columns 
df['col2'].unique()  # nunique gives number of unique in the column

array([444, 555, 666])

In [6]:
df['col2'].value_counts() # gives a count of all the unique values 
                          # value_counts() method can work on a series data

444    2
555    1
666    1
Name: col2, dtype: int64

In [9]:
df[df['col1']>2]  # conditional selection

   col1  col2 col3
2     3   666  ghi
3     4   444  jkl

In [8]:
# we will now define a function and try to apply that function to the elements in the DF.
def times2(x) : 
    return x*2

In [9]:
df['col2'].apply(times2)  # applies func will apply a method to the entire series on which it is applied 
                          # in the example here we apply times2() on all elements to the df['col1'] series.

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [15]:
df['col3'].apply(len)  # this applies the built in function for len to all the string sin col3 column.

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [16]:
# applying lambda functions to elements in the data frame. 
df['col2'].apply(lambda x: x*2)   # here the lambda function is same as times2

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [17]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  jkl

In [19]:
# getting the column names 
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [21]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [23]:
# sorting the df on a column 
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi

In [24]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

## Creating Pivot Tables in Data Frames

In [26]:
data = {'A' : ['foo', 'foo', 'foo', 'bar', 'bar','bar'], 
        'B' : ['one', 'two', 'two', 'two', 'one', 'one'], 
        'C' : ['x','y','x','y','x','y'], 
        'D' : [1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [27]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  two  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [29]:
df.pivot_table(values='D', index = ['A','B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  NaN
    two  2.0  3.0